<template>
	<div class="empty position-relative">
		<svg version="1.1" id="logo" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px"
			viewBox="0 0 28.46 28.46" style="enable-background:new 0 0 28.46 28.46;" xml:space="preserve">
			<g>
				<path d="M8.825,17.157c-3.564-0.992-6.09-3.074-6.09-5.423c0-3.274,4.895-6.04,10.69-6.04
					c5.453,0,10.107,2.45,10.637,5.467c1.016,0.36,1.938,0.828,2.727,1.395c0.037-0.27,0.061-0.543,0.061-0.821
					c0-4.921-5.897-8.775-13.425-8.775S0,6.814,0,11.734c0,3.955,3.813,7.218,9.216,8.347c-0.285-0.69-0.442-1.426-0.442-2.191
					C8.775,17.643,8.794,17.398,8.825,17.157z M27.067,21.185c0.88-0.948,1.393-2.073,1.393-3.295c0-1.502-0.763-2.862-2.048-3.92
					c-0.673-0.555-1.495-1.02-2.42-1.385c-1.365-0.539-2.962-0.851-4.691-0.851c-4.927,0-8.819,2.49-9.128,5.739
					c-0.013,0.138-0.03,0.275-0.03,0.415c0,0.882,0.266,1.714,0.743,2.465c1.389,2.188,4.592,3.688,8.416,3.688
					c1.542,0,2.981-0.248,4.244-0.682l4.492,2.141C28.038,25.5,27.067,21.185,27.067,21.185z M15.148,20.435
					c-1.41-0.674-2.27-1.633-2.27-2.545c0-0.043,0.022-0.086,0.026-0.129c0.135-1.584,2.712-3.291,6.398-3.291
					c1.169,0,2.21,0.188,3.117,0.472c1.072,0.337,1.923,0.824,2.494,1.381c0.509,0.498,0.813,1.039,0.813,1.566
					c0,1.616-2.638,3.419-6.424,3.419C17.65,21.309,16.239,20.954,15.148,20.435z"/>
			</g>
		</svg>
		<p class="text-secondary text-center position-absolute" style="bottom: 0; width: 300px; left: Calc(50% - 150px); font-size: 0.875rem; letter-spacing: 1px;">
			Разработал<font-awesome-icon :icon="['fas', 'code']" class="text-secondary mx-2"/>Волосюк Даниил
		</p>
	</div>

</template>

<style lang="scss">
	.empty {
		display: flex;
		justify-content: center;
		align-items: center;
		padding-bottom: 10%;
		#logo {
			width: 50%;
			path {
				fill: #fde0e0; //#e9e9eb;
			}
		}
	}


	@media (max-width: 992px) {
		.empty #logo {
			width: 60%;
		}
	}
	@media (max-width: 768px) {
		.empty #logo {
			width: 70%;
		}
	}
</style>